#та эрдэнсийн эрэлд гарсан хүн
#хэрэв та зоос олвол түүнийг ямар зүйлээр үржүүлэхгүй хувсагч found_couns
#хэрвээ иа шидэт зоос олвол түүнийг 365-аар үржин нэмэгдүүлж авна:
#хэрвээ та зоос хулгайлвал 52-дахин үржүүлж авна

#та дээрх хувсагчуудыг үүсгээд түүнийгээ тодорхой утгуудаар оруулаад дараа нь нийт хэдэн зоос олныгоо хувьсагчид хадгал

found_coins = 45
magic_coins= 100
stolen_coins= 44

total_coins = found_coins+magic_coins*365+stolen_coins* 52
print('Total coins of mine is:',total_coins)


